export const projects = [
    {
        title: "ระบบจัดสรรน้ำเพื่อการเกษตรด้วย AI",
        description: "ช่วยจัดสรรน้ำที่มีอยู่ในระบบให้เพียงพอต่อการใช้งานของแต่ละครัวเรือน อาศัยข้อมูลการคาดการปริมาณน้ำล่วงหน้า เพื่อที่จะทำการจัดสรรโควต้าปริมาณน้ำของแต่ละครัวเรือน ให้เพียงพอสำหรับทุกครัวเรือนในหมู่บ้าน",
        image: "public/img/Project/depa.jpg",
        link: "https://cloud.aimlxv.me/s/depa"
    },
    {
        title: "ระบบจัดการอัคคีภัยภายในบ้าน (Smart Home)",
        description: "จากการศึกษาพบว่าในแต่ละปีเกิดอุบัติเหตุจากแก๊สหุงต้มและการระเบิดหลายครั้งในประเทศไทย ดังนั้นการพัฒนาระบบจัดการอัคคีภัยจึงเป็นสิ่งจำเป็นเพื่อช่วยลดความเสียหายที่จะเกิดขึ้น",
        image: "public/img/Project/fire.png",
        link: "https://cloud.aimlxv.me/s/Fire"
    },
    {
        title: "โมเดลสำหรับจำแนกประเภทและทำนายมูลค่าของรูปภาพ AI",
        description: "โมเดล AI ทีสามารถจําแนกได้ว่าแต่ละรูปอยู่ในหมวดใดบ้าง + ความสามารถที่ประเมินราคาของรูปภาพได้อย่างแม่นยํา",
        image: "public/img/Project/NGI_13.png",
        link: "https://cloud.aimlxv.me/s/NGI"
    },
    {
        title: "เหรียญเงิน แข่งขันหุ่นยนต์ระดับสูง ม.ปลาย",
        description: "งานศิลปหัตถกรรมนักเรียนระดับเขตพื้นที่การศึกษา สพม.39 ครั้งที่ 70-71 ปีการศึกษา 2565-2566",
        image: "public/img/Project/high.jpg",
        link: "https://cloud.aimlxv.me/s/art"
    },
    {
        title: "เข้าร่วมแข่งขันในรอบชิงชนะเลิศ ประเภท Robo Soccer",
        description: "การแข่งขันหุ่นยนต์ ส.ส.ท.-สพฐ. ยุวชน ครั้งที่ 23-24 ประจำปี 2566-2567",
        image: "public/img/Project/TPA.jpg",
        link: "https://cloud.aimlxv.me/s/TPARobot"
    },
    {
        title: "CHS Centennial Run 100th Website",
        description: "Front-End Developer เว็บไชต์รับสมัครมินิมาราธอนเฉลิมฉลองครบรอบ 100 ปี โรงเรียนเฉลิมขวัญสตรี 🏃🏻‍♂️🏃🏻‍♀️",
        image: "public/img/Project/run.png",
        link: "https://www.facebook.com/p/CHS-Centennial-RUN-100th-100094773282617/"
    }
];
