// maybe more projects in the future 😆
export const projects = [
    {
        title: "ระบบจัดสรรน้ำเพื่อการเกษตรด้วย AI",
        description: "ระบบบริหารจัดการน้ำอัจฉริยะ โดยใช้ AI วิเคราะห์และคาดการณ์ปริมาณน้ำล่วงหน้า เพื่อจัดสรรโควตาน้ำให้เพียงพอและทั่วถึงสำหรับทุกครัวเรือนในพื้นที่",
        image: "public/img/Project/depa.jpg",
        link: "https://cloud.aimlxv.me/s/depa"
    },
    {
        title: "ระบบป้องกันอัคคีภัยภายในบ้าน (Smart Home)",
        description: "พัฒนาระบบ IoT สำหรับตรวจจับและแจ้งเตือนภัยจากแก๊สหุงต้มและอัคคีภัย เพื่อเพิ่มความปลอดภัยและลดความเสี่ยงจากอุบัติเหตุภายในที่พักอาศัย",
        image: "public/img/Project/fire.png",
        link: "https://cloud.aimlxv.me/s/Fire"
    },
    {
        title: "AI จำแนกประเภทและประเมินมูลค่ารูปภาพ",
        description: "โมเดล AI deep learning ที่มีความสามารถในการจำแนกหมวดหมู่ของรูปภาพ (Classification) พร้อมฟีเจอร์การทำนายและประเมินมูลค่าของภาพได้อย่างแม่นยำ",
        image: "public/img/Project/NGI_13.png",
        link: "https://cloud.aimlxv.me/s/NGI"
    },
    {
        title: "เหรียญเงิน แข่งขันหุ่นยนต์ระดับสูง ม.ปลาย",
        description: "รางวัลระดับเหรียญเงิน งานศิลปหัตถกรรมนักเรียน ระดับเขตพื้นที่การศึกษา สพม.39 ต่อเนื่อง 2 ปีซ้อน (ปีการศึกษา 2565-2566)",
        image: "public/img/Project/high.jpg",
        link: "https://cloud.aimlxv.me/s/art"
    },
    {
        title: "Finalist การแข่งขันหุ่นยนต์ Robo Soccer",
        description: "ผู้ผ่านเข้ารอบชิงชนะเลิศ การแข่งขันหุ่นยนต์ ส.ส.ท.-สพฐ. ยุวชน ประเภท Robo Soccer ต่อเนื่อง 2 ปี (ครั้งที่ 23-24 ประจำปี 2566-2567)",
        image: "public/img/Project/TPA.jpg",
        link: "https://cloud.aimlxv.me/s/TPARobot"
    },
    {
        title: "CHS Centennial Run 100th Website",
        description: "Front-End Developer พัฒนาเว็บไซต์ระบบรับสมัครงานวิ่งมินิมาราธอน เนื่องในวาระเฉลิมฉลองครบรอบ 100 ปี โรงเรียนเฉลิมขวัญสตรี",
        image: "public/img/Project/run.png",
        link: "https://www.facebook.com/p/CHS-Centennial-RUN-100th-100094773282617/"
    },
    {
        title: "Recipe Manager AI",
        description: "เว็บแอปพลิเคชันบริหารจัดการสูตรอาหาร ผสานเทคโนโลยี Generative AI ช่วยรังสรรค์สูตรอาหารเมนูใหม่จากวัตถุดิบที่มีอยู่ (Ingredient-based Generation)",
        image: "public/img/Project/ai_recipe.png",
        link: "https://github.com/Croissant-no-Yuusha/20-Croissant-no-Maou"
    },
    {
        title: "ผู้ช่วยสอน (TA) ค่าย สอวน. คอมพิวเตอร์",
        description: "รับหน้าที่พี่เลี้ยงวิชาการ ค่าย 1 ศูนย์โรงเรียนเฉลิมขวัญสตรี ดูแลระบบ Grader (Backend Server) และให้คำปรึกษาด้านอัลกอริทึมและการเขียนโปรแกรมแก่ผู้เข้าค่าย",
        image: "public/img/Project/posnta.jpg",
        link: "https://www.facebook.com/profile.php?id=100086664457918"
    },
    {
        title: "นักศึกษาฝึกงานโครงการ Talent RAC",
        description: "ร่วมพัฒนาโปรเจกต์ระบบอัตโนมัติโดยใช้งานหุ่นยนต์ร่วมปฏิบัติงาน (Cobot) และออกแบบระบบสายพานลำเลียง (Conveyor) สำหรับการขนย้ายสินค้าในภาคอุตสาหกรรม",
        image: "public/img/Project/rac.jpg",
        link: "https://rac.thairobotics.org/2023/10/27/conveyor-system/"
    }
];